results/deno/acorn.txt
Bundle: n/a
Startup: 135.8 ms
Memory before: 79.5 MB

bombardier --fasthttp -c 500 -d 10s http://127.0.0.1:3000/
Bombarding http://127.0.0.1:3000/ for 10s using 500 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     12498.38    7716.92   26368.53
  Latency       40.25ms   102.51ms      6.48s
  HTTP codes:
    1xx - 0, 2xx - 124538, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:     2.90MB/s

bombardier --fasthttp -c 500 -d 10s http://127.0.0.1:3000/id/1?name=bun
Bombarding http://127.0.0.1:3000/id/1?name=bun for 10s using 500 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     13264.40    8503.03   26369.11
  Latency       37.89ms     5.90ms   322.34ms
  HTTP codes:
    1xx - 0, 2xx - 131947, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:     3.60MB/s

bombardier --fasthttp -c 500 -d 10s -m POST -H Content-Type:application/json -f ./scripts/body.json http://127.0.0.1:3000/json
Bombarding http://127.0.0.1:3000/json for 10s using 500 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     13563.71    8093.83   29983.13
  Latency       37.24ms    51.61ms      2.12s
  HTTP codes:
    1xx - 0, 2xx - 134382, 3xx - 0, 4xx - 0, 5xx - 0
    others - 77
  Errors:
       timeout - 77
  Throughput:     4.28MB/s

bombardier --fasthttp -c 10 -d 10s -H Cache-Control:no-store -H If-None-Match:"benchmark-force-full-response" http://127.0.0.1:3000/video
Bombarding http://127.0.0.1:3000/video for 10s using 10 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec       226.07      85.73     503.52
  Latency       44.17ms     6.33ms   120.58ms
  HTTP codes:
    1xx - 0, 2xx - 2266, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:     2.98GB/s

Memory after: 424.8 MB