results/deno/deno-web-standard.txt
Bundle: n/a
Startup: 14.5 ms
Memory before: 29.7 MB

bombardier --fasthttp -c 500 -d 10s http://127.0.0.1:3000/
Bombarding http://127.0.0.1:3000/ for 10s using 500 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec    122651.15    2939.03  141816.32
  Latency        4.07ms     1.23ms   134.75ms
  HTTP codes:
    1xx - 0, 2xx - 1226730, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    20.93MB/s

bombardier --fasthttp -c 500 -d 10s http://127.0.0.1:3000/id/1?name=bun
Bombarding http://127.0.0.1:3000/id/1?name=bun for 10s using 500 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec    109978.93    6624.95  120794.97
  Latency        4.54ms     1.29ms   124.72ms
  HTTP codes:
    1xx - 0, 2xx - 1100134, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    23.07MB/s

bombardier --fasthttp -c 500 -d 10s -m POST -H Content-Type:application/json -f ./scripts/body.json http://127.0.0.1:3000/json
Bombarding http://127.0.0.1:3000/json for 10s using 500 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec    129299.90    4907.97  153168.95
  Latency        3.86ms   583.49us    70.60ms
  HTTP codes:
    1xx - 0, 2xx - 1293392, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    33.17MB/s

bombardier --fasthttp -c 10 -d 10s -H Cache-Control:no-store -H If-None-Match:"benchmark-force-full-response" http://127.0.0.1:3000/video
Bombarding http://127.0.0.1:3000/video for 10s using 10 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec       276.15     103.36     532.77
  Latency       36.18ms     5.98ms    81.56ms
  HTTP codes:
    1xx - 0, 2xx - 2767, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:     3.64GB/s

Memory after: 68.2 MB