results/deno/deno.txt
Bundle: n/a
Startup: 23.1 ms
Memory before: 29.8 MB

bombardier --fasthttp -c 500 -d 10s http://127.0.0.1:3000/
Bombarding http://127.0.0.1:3000/ for 10s using 500 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec    118549.66   11779.51  137100.80
  Latency        4.22ms   632.13us    84.43ms
  HTTP codes:
    1xx - 0, 2xx - 1185624, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    20.23MB/s

bombardier --fasthttp -c 500 -d 10s http://127.0.0.1:3000/id/1?name=bun
Bombarding http://127.0.0.1:3000/id/1?name=bun for 10s using 500 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec    108855.85   10631.19  122926.05
  Latency        4.59ms   772.93us    74.64ms
  HTTP codes:
    1xx - 0, 2xx - 1088847, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    22.84MB/s

bombardier --fasthttp -c 500 -d 10s -m POST -H Content-Type:application/json -f ./scripts/body.json http://127.0.0.1:3000/json
Bombarding http://127.0.0.1:3000/json for 10s using 500 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec    120276.32   12882.28  134694.29
  Latency        4.15ms   642.81us    70.60ms
  HTTP codes:
    1xx - 0, 2xx - 1203113, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    30.85MB/s

bombardier --fasthttp -c 10 -d 10s -H Cache-Control:no-store -H If-None-Match:"benchmark-force-full-response" http://127.0.0.1:3000/video
Bombarding http://127.0.0.1:3000/video for 10s using 10 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec       330.84     132.13     539.94
  Latency       30.21ms     4.36ms    63.31ms
  HTTP codes:
    1xx - 0, 2xx - 3316, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:     4.36GB/s

Memory after: 69.9 MB