results/deno/h3.txt
Bundle: n/a
Startup: 28.3 ms
Memory before: 40.2 MB

bombardier --fasthttp -c 500 -d 10s http://127.0.0.1:3000/
Bombarding http://127.0.0.1:3000/ for 10s using 500 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec    112639.82    7891.66  128975.26
  Latency        4.44ms     1.33ms   134.33ms
  HTTP codes:
    1xx - 0, 2xx - 1126643, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    19.23MB/s

bombardier --fasthttp -c 500 -d 10s http://127.0.0.1:3000/id/1?name=bun
Bombarding http://127.0.0.1:3000/id/1?name=bun for 10s using 500 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     94698.03    7626.00  111751.10
  Latency        5.28ms     1.52ms   145.35ms
  HTTP codes:
    1xx - 0, 2xx - 947210, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    19.86MB/s

bombardier --fasthttp -c 500 -d 10s -m POST -H Content-Type:application/json -f ./scripts/body.json http://127.0.0.1:3000/json
Bombarding http://127.0.0.1:3000/json for 10s using 500 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec    104067.40    6456.78  121805.56
  Latency        4.80ms   493.09us    75.23ms
  HTTP codes:
    1xx - 0, 2xx - 1040921, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    28.08MB/s

bombardier --fasthttp -c 10 -d 10s -H Cache-Control:no-store -H If-None-Match:"benchmark-force-full-response" http://127.0.0.1:3000/video
Bombarding http://127.0.0.1:3000/video for 10s using 10 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec       272.86     105.61     580.29
  Latency       36.61ms     7.67ms    82.26ms
  HTTP codes:
    1xx - 0, 2xx - 2736, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:     3.60GB/s

Memory after: 72.7 MB