results/deno/hono.txt
Bundle: n/a
Startup: 57.2 ms
Memory before: 36.0 MB

bombardier --fasthttp -c 500 -d 10s http://127.0.0.1:3000/
Bombarding http://127.0.0.1:3000/ for 10s using 500 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec    126475.16    9264.09  140418.43
  Latency        3.95ms   715.90us    70.43ms
  HTTP codes:
    1xx - 0, 2xx - 1264632, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    21.58MB/s

bombardier --fasthttp -c 500 -d 10s http://127.0.0.1:3000/id/1?name=bun
Bombarding http://127.0.0.1:3000/id/1?name=bun for 10s using 500 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec    106523.71    6925.25  120240.28
  Latency        4.69ms   682.89us    75.83ms
  HTTP codes:
    1xx - 0, 2xx - 1065522, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    22.45MB/s

bombardier --fasthttp -c 500 -d 10s -m POST -H Content-Type:application/json -f ./scripts/body.json http://127.0.0.1:3000/json
Bombarding http://127.0.0.1:3000/json for 10s using 500 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec    112007.64    6896.24  126528.99
  Latency        4.46ms   611.54us    72.02ms
  HTTP codes:
    1xx - 0, 2xx - 1120449, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    30.33MB/s

bombardier --fasthttp -c 10 -d 10s -H Cache-Control:no-store -H If-None-Match:"benchmark-force-full-response" http://127.0.0.1:3000/video
Bombarding http://127.0.0.1:3000/video for 10s using 10 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec       269.88     127.66     530.23
  Latency       36.97ms     5.93ms    71.41ms
  HTTP codes:
    1xx - 0, 2xx - 2710, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:     3.56GB/s

Memory after: 80.7 MB