results/deno/oak.txt
Bundle: n/a
Startup: 113.7 ms
Memory before: 71.6 MB

bombardier --fasthttp -c 500 -d 10s http://127.0.0.1:3000/
Bombarding http://127.0.0.1:3000/ for 10s using 500 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     31228.02    8962.37   50342.22
  Latency       16.01ms    26.37ms      1.10s
  HTTP codes:
    1xx - 0, 2xx - 312192, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:     7.32MB/s

bombardier --fasthttp -c 500 -d 10s http://127.0.0.1:3000/id/1?name=bun
Bombarding http://127.0.0.1:3000/id/1?name=bun for 10s using 500 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     26355.26    9075.10   49872.00
  Latency       18.93ms    26.09ms      1.65s
  HTTP codes:
    1xx - 0, 2xx - 264421, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:     7.23MB/s

bombardier --fasthttp -c 500 -d 10s -m POST -H Content-Type:application/json -f ./scripts/body.json http://127.0.0.1:3000/json
Bombarding http://127.0.0.1:3000/json for 10s using 500 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     20321.13    8140.75   43078.57
  Latency       24.67ms    24.15ms      1.21s
  HTTP codes:
    1xx - 0, 2xx - 202761, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:     6.76MB/s

bombardier --fasthttp -c 10 -d 10s -H Cache-Control:no-store -H If-None-Match:"benchmark-force-full-response" http://127.0.0.1:3000/video
Bombarding http://127.0.0.1:3000/video for 10s using 10 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec       218.26     142.16     502.43
  Latency       45.75ms     6.91ms   141.53ms
  HTTP codes:
    1xx - 0, 2xx - 2190, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:     2.88GB/s

Memory after: 245.3 MB