results/deno/vercube.txt
Bundle: n/a
Startup: 64.1 ms
Memory before: 47.8 MB

bombardier --fasthttp -c 500 -d 10s http://127.0.0.1:3000/
Bombarding http://127.0.0.1:3000/ for 10s using 500 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec    105536.04    5823.83  119436.32
  Latency        4.74ms     1.63ms   140.20ms
  HTTP codes:
    1xx - 0, 2xx - 1055638, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    19.12MB/s

bombardier --fasthttp -c 500 -d 10s http://127.0.0.1:3000/id/1?name=bun
Bombarding http://127.0.0.1:3000/id/1?name=bun for 10s using 500 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     92968.17   10562.85  117887.52
  Latency        5.38ms   737.33us    41.76ms
  HTTP codes:
    1xx - 0, 2xx - 929944, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    18.26MB/s

bombardier --fasthttp -c 500 -d 10s -m POST -H Content-Type:application/json -f ./scripts/body.json http://127.0.0.1:3000/json
Bombarding http://127.0.0.1:3000/json for 10s using 500 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     96124.45   10447.80  115922.94
  Latency        5.20ms     1.50ms    75.10ms
  HTTP codes:
    1xx - 0, 2xx - 961287, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    24.65MB/s

bombardier --fasthttp -c 10 -d 10s -H Cache-Control:no-store -H If-None-Match:"benchmark-force-full-response" http://127.0.0.1:3000/video
Bombarding http://127.0.0.1:3000/video for 10s using 10 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec       319.71     113.26     619.08
  Latency       31.27ms     4.48ms    42.44ms
  HTTP codes:
    1xx - 0, 2xx - 3205, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:     4.21GB/s

Memory after: 165.0 MB